// Найти квадрат числа
Console.WriteLine("Введите число");
double num = Convert.ToDouble (Console.ReadLine());
double result = num*num;
Console.WriteLine("Квадрат числа");
Console.WriteLine(result);

