// Даны два числа. Показать большее и меньшее число
Console.WriteLine("Введите первое число");
double A = Convert.ToDouble (Console.ReadLine());
Console.WriteLine("Введите второе число");
double B = Convert.ToDouble (Console.ReadLine());
if (A>B)
Console.WriteLine("Первое число - большее, второе - меньшее");
else
Console.WriteLine("Второе число - большее, первое - меньшее");

