// Найти третью цифру числа или сообщить, что её нет
Console.WriteLine("Введите любое число больше 100");
//попробовать через индекс 2
